def number_to_words(n):
    f = {1: 'один', 
        2: 'два', 
        3: 'три', 
        4: 'четыре', 
        5: 'пять',
        6: 'шесть', 
        7: 'семь', 
        8: 'восемь', 
        9: 'девять'}
    o = {10: 'Десять', 
        20: 'Двадцать', 
        30: 'Тридцать', 
        40: 'Сорок',
        50: 'Пятьдесят', 
        60: 'Шестьдесят', 
        70: 'Семьдесят',
        80: 'Восемьдесят', 
        90: 'Девяносто'}
    s = {11: 'Одиннадцать', 
        12: 'Двенадцать', 
        13: 'Тринадцать',
        14: 'Четырнадцать', 
        15: 'Пятнадцать', 
        16: 'Шестнадцать',
        17: 'Семнадцать', 
        18: 'Восемнадцать', 
        19: 'Девятнадцать'}

    n1 = n % 10
    n2 = n - n1

    if n < 10:
        return f.get(n)
    elif 10 < n < 20:
        return s.get(n)
    elif n >= 10 and n in o:
        return o.get(n)
    else:
        return o.get(n2) + ' ' + f.get(n1)

print(number_to_words(44))